/**
 * 2018. 5. 15. Dev. by D. A. Lee
 */
package chap09;

import java.util.Date;

public class StringTest1 {
	public static void main(String[] args) {
		
		long start = System.currentTimeMillis();		
		for(int i=0; i<1000000000; i++) {}
		String str1 = "아름다운" + "이" + "땅에" + "금수강산에" + "단군" + "할아버지가" + "터잡으시고" + "홍익인간" + "뜻으로" + "나라" + "세우니" + "대대손손" + "훌륭한" + "인물도" + "많아" + "고구려" + "세운" + "동명왕" + "백제" + "온조왕" + "알에서" + "나온" + "혁거세" + "만주" + "벌판" + "달려라" + "광개토대왕" + "신라" + "장군" + "이사부" + "백결" + "선생" + "떡방아" + "삼천" + "궁녀" + "의자왕" + "황산벌의" + "계백" + "맞서" + "싸운" + "관창" + "역사는" + "흐른다" + "말목" + "자른" + "김유신" + "통일" + "문무왕" + "원효대사" + "해골물" + "혜초" + "천축국" + "바다의" + "왕자" + "장보고" + "발해" + "대조영" + "귀주대첩" + "강감찬" + "서희" + "거란족" + "무단" + "정치" + "정중부" + "화포" + "최무선" + "죽림칠현" + "김부식" + "지눌국사" + "조계종" + "의천" + "천태종" + "대마도" + "정벌" + "이종무" + "일편단심" + "정몽주" + "목화씨는" + "문익점" + "해동공자" + "최충" + "삼국유사" + "일연" + "역사는" + "흐른다" + "황금을" + "보기를" + "돌같이" + "하라" + "최영" + "장군의" + "말씀" + "받들자" + "황희" + "정승" + "맹사성" + "과학" + "장영실" + "신숙주와" + "한명회" + "역사는" + "안다" + "십만" + "양병" + "이율곡" + "주리" + "이퇴계" + "신사임당" + "오죽헌" + "잘" + "싸운다" + "곽재우" + "조헌" + "김시민" + "나라" + "구한" + "이순신" + "태정태세문단세" + "사육신과" + "생육신" + "몸바쳐서" + "논개" + "행주치마" + "권율" + "역사는" + "흐른다" + "번쩍번쩍" + "홍길동" + "의적" + "임꺽정" + "대쪽같은" + "삼학사" + "어사" + "박문수" + "삼년" + "공부" + "한석봉" + "단원" + "풍속도" + "방랑" + "시인" + "김삿갓" + "지도" + "김정호" + "영조대왕" + "신문고" + "정조" + "규장각" + "목민심서" + "정약용" + "녹두" + "장군" + "전봉준" + "순교" + "김대건" + "서화가무" + "황진이" + "못살겠다" + "홍경래" + "삼일천하" + "김옥균" + "안중근은" + "애국" + "이완용은" + "매국" + "역사는" + "흐른다" + "별" + "헤는" + "밤" + "윤동주" + "종두" + "지석영" + "삼십삼인" + "손병희" + "만세" + "만세" + "유관순" + "도산" + "안창호" + "어린이날" + "방정환" + "이수일과" + "심순애" + "장군의" + "아들" + "김두한" + "날자꾸나" + "이상" + "황소" + "그림" + "이중섭" + "역사는" + "흐른다";

		System.out.println(str1);
		long end = System.currentTimeMillis();
		System.out.println("실행 시간 : " + (end-start)/1000.0);
		
		
		start = System.currentTimeMillis();
		for(int i=0; i<1000000000; i++) {}
		String str2 = "아름다운"; str2 +=  "이" ; str2 +=  "땅에" ; str2 +=  "금수강산에" ; str2 +=  "단군" ; str2 +=  "할아버지가" ; str2 +=  "터잡으시고" ; str2 +=  "홍익인간" ; str2 +=  "뜻으로" ; str2 +=  "나라" ; str2 +=  "세우니" ; str2 +=  "대대손손" ; str2 +=  "훌륭한" ; str2 +=  "인물도" ; str2 +=  "많아" ; str2 +=  "고구려" ; str2 +=  "세운" ; str2 +=  "동명왕" ; str2 +=  "백제" ; str2 +=  "온조왕" ; str2 +=  "알에서" ; str2 +=  "나온" ; str2 +=  "혁거세" ; str2 +=  "만주" ; str2 +=  "벌판" ; str2 +=  "달려라" ; str2 +=  "광개토대왕" ; str2 +=  "신라" ; str2 +=  "장군" ; str2 +=  "이사부" ; str2 +=  "백결" ; str2 +=  "선생" ; str2 +=  "떡방아" ; str2 +=  "삼천" ; str2 +=  "궁녀" ; str2 +=  "의자왕" ; str2 +=  "황산벌의" ; str2 +=  "계백" ; str2 +=  "맞서" ; str2 +=  "싸운" ; str2 +=  "관창" ; str2 +=  "역사는" ; str2 +=  "흐른다" ; str2 +=  "말목" ; str2 +=  "자른" ; str2 +=  "김유신" ; str2 +=  "통일" ; str2 +=  "문무왕" ; str2 +=  "원효대사" ; str2 +=  "해골물" ; str2 +=  "혜초" ; str2 +=  "천축국" ; str2 +=  "바다의" ; str2 +=  "왕자" ; str2 +=  "장보고" ; str2 +=  "발해" ; str2 +=  "대조영" ; str2 +=  "귀주대첩" ; str2 +=  "강감찬" ; str2 +=  "서희" ; str2 +=  "거란족" ; str2 +=  "무단" ; str2 +=  "정치" ; str2 +=  "정중부" ; str2 +=  "화포" ; str2 +=  "최무선" ; str2 +=  "죽림칠현" ; str2 +=  "김부식" ; str2 +=  "지눌국사" ; str2 +=  "조계종" ; str2 +=  "의천" ; str2 +=  "천태종" ; str2 +=  "대마도" ; str2 +=  "정벌" ; str2 +=  "이종무" ; str2 +=  "일편단심" ; str2 +=  "정몽주" ; str2 +=  "목화씨는" ; str2 +=  "문익점" ; str2 +=  "해동공자" ; str2 +=  "최충" ; str2 +=  "삼국유사" ; str2 +=  "일연" ; str2 +=  "역사는" ; str2 +=  "흐른다" ; str2 +=  "황금을" ; str2 +=  "보기를" ; str2 +=  "돌같이" ; str2 +=  "하라" ; str2 +=  "최영" ; str2 +=  "장군의" ; str2 +=  "말씀" ; str2 +=  "받들자" ; str2 +=  "황희" ; str2 +=  "정승" ; str2 +=  "맹사성" ; str2 +=  "과학" ; str2 +=  "장영실" ; str2 +=  "신숙주와" ; str2 +=  "한명회" ; str2 +=  "역사는" ; str2 +=  "안다" ; str2 +=  "십만" ; str2 +=  "양병" ; str2 +=  "이율곡" ; str2 +=  "주리" ; str2 +=  "이퇴계" ; str2 +=  "신사임당" ; str2 +=  "오죽헌" ; str2 +=  "잘" ; str2 +=  "싸운다" ; str2 +=  "곽재우" ; str2 +=  "조헌" ; str2 +=  "김시민" ; str2 +=  "나라" ; str2 +=  "구한" ; str2 +=  "이순신" ; str2 +=  "태정태세문단세" ; str2 +=  "사육신과" ; str2 +=  "생육신" ; str2 +=  "몸바쳐서" ; str2 +=  "논개" ; str2 +=  "행주치마" ; str2 +=  "권율" ; str2 +=  "역사는" ; str2 +=  "흐른다" ; str2 +=  "번쩍번쩍" ; str2 +=  "홍길동" ; str2 +=  "의적" ; str2 +=  "임꺽정" ; str2 +=  "대쪽같은" ; str2 +=  "삼학사" ; str2 +=  "어사" ; str2 +=  "박문수" ; str2 +=  "삼년" ; str2 +=  "공부" ; str2 +=  "한석봉" ; str2 +=  "단원" ; str2 +=  "풍속도" ; str2 +=  "방랑" ; str2 +=  "시인" ; str2 +=  "김삿갓" ; str2 +=  "지도" ; str2 +=  "김정호" ; str2 +=  "영조대왕" ; str2 +=  "신문고" ; str2 +=  "정조" ; str2 +=  "규장각" ; str2 +=  "목민심서" ; str2 +=  "정약용" ; str2 +=  "녹두" ; str2 +=  "장군" ; str2 +=  "전봉준" ; str2 +=  "순교" ; str2 +=  "김대건" ; str2 +=  "서화가무" ; str2 +=  "황진이" ; str2 +=  "못살겠다" ; str2 +=  "홍경래" ; str2 +=  "삼일천하" ; str2 +=  "김옥균" ; str2 +=  "안중근은" ; str2 +=  "애국" ; str2 +=  "이완용은" ; str2 +=  "매국" ; str2 +=  "역사는" ; str2 +=  "흐른다" ; str2 +=  "별" ; str2 +=  "헤는" ; str2 +=  "밤" ; str2 +=  "윤동주" ; str2 +=  "종두" ; str2 +=  "지석영" ; str2 +=  "삼십삼인" ; str2 +=  "손병희" ; str2 +=  "만세" ; str2 +=  "만세" ; str2 +=  "유관순" ; str2 +=  "도산" ; str2 +=  "안창호" ; str2 +=  "어린이날" ; str2 +=  "방정환" ; str2 +=  "이수일과" ; str2 +=  "심순애" ; str2 +=  "장군의" ; str2 +=  "아들" ; str2 +=  "김두한" ; str2 +=  "날자꾸나" ; str2 +=  "이상" ; str2 +=  "황소" ; str2 +=  "그림" ; str2 +=  "이중섭" ; str2 +=  "역사는" ; str2 +=  "흐른다";

		System.out.println(str2);
		end = System.currentTimeMillis();
		System.out.println("실행 시간 : " + (end-start)/1000.0);
	}

}
